title: Lumma Stealer DNS Query
id: 8f1a4f10-3c0d-4d3a-92b8-lumma001
status: experimental
description: Detects DNS queries for the Lumma Stealer domain genhqq.xyz
author: Agata Gabara
date: 2025-06-26

logsource:
  product: windows
  category: dns_query

detection:
  selection:
    QueryName: "genhqq.xyz"
  condition: selection

level: high

tags:
  - attack.command_and_control
  - attack.t1071